docs/maintanence guide.org
#+TITLE: Maintainence Guide
#+AUTHOR: zheyu
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="/Users/zheyu/Sync/Workflow/Css/1/styles/readtheorg/css/readtheorg.css"/>
#+OPTIONS: ^:nil

* Dependencies
- The program is tested on Python 3.74, Django 3.09, Django Rest Framework 3.9, Ant Design Pro 4.0 (GGEditor 2.04)
- According to Django Rest Framework's official documentations, the following requirements are optional
  - PyYAML, uritemplate (5.1+, 3.0.0+) - Schema generation support.
  - Markdown (3.0.0+) - Markdown support for the browsable API.
  - Pygments (2.4.0+) - Add syntax highlighting to Markdown processing.
  - django-filter (1.0.1+) - Filtering support.
  - django-guardian (1.1.1+) - Object level permissions support.
  
* Develop & Build
- Use 'npm start' to run front-end application in developing environment
- Use 'umi build' to build front-end pages, all the build files will be stored in the '/dist' folder
- Front-end program is set to run on port 8000, you can change the port in '/config/proxy.ts'
- run backend service on port 9000

#+begin_src
python3 manage.py runserver 9000
#+end_src

* Deployment
** Environment Preparation
- Install required Python3 packages manually (tested on Debian 10)

#+begin_src bash
  apt-get install python3-pip
  pip3 install django
  pip3 install djangorestframework
  pip3 install markdown
  pip3 install django-filter
  pip3 install pymysql
  pip3 install djangorestframework-jwt
#+end_src

- Install required Python3 packages automatically
  - you can also install the required packages using 'requirements.txt' (not tested)

#+begin_src bash
  pip install -r requirements.txt
#+end_src

** Nginx Configuration
- Put all the front-end build files in Nginx' target folder, then modify the Nginx configuration manually
- This is an example of Nginx configuration
  - The program does not force SSL connection, but it is recommended to add SSL support
- The back-end service is running on port 9000, you can change the number to any ports you want, but remember to change the backend service too

#+begin_src
server {
        lisnten 80;
        server_name yourdomainname.com;

        root /path/to/your/folder/;
        index index.html;

        location / {
                try_files $uri $uri/ /index.html;
        }

        location /api {
                proxy_pass http://localhost:9000;
                proxy_redirect default;
        }
}
#+end_src

** Back-end Application
- As Python does not enforce developers to compile its source code before running, the back-end application can be run directly through Django's 'run server' command

* APIs & Source Code Structure
