docs/maintanence guide.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-08-22 Sat 20:31 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Maintainence Guide</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="zheyu" />
<link rel="stylesheet" type="text/css" href="/Users/zheyu/Sync/Workflow/Css/1/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Maintainence Guide</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd2f2924">1. Dependencies</a></li>
<li><a href="#orgd9be24e">2. Develop &amp; Build</a></li>
<li><a href="#org3729bd7">3. Deployment</a>
<ul>
<li><a href="#orgd3c1aea">3.1. Environment Preparation</a></li>
<li><a href="#orgbf8eec2">3.2. Nginx Configuration</a></li>
<li><a href="#org730a189">3.3. Back-end Application</a></li>
</ul>
</li>
<li><a href="#org1b0bf99">4. APIs &amp; Source Code Structure</a>
<ul>
<li><a href="#orgd09410c">4.1. APIs</a></li>
<li><a href="#org8de0890">4.2. Source Code Structure</a></li>
</ul>
</li>
<li><a href="#org06af382">5. Database</a>
<ul>
<li><a href="#org8aacc3b">5.1. Care Setting</a></li>
<li><a href="#org911d40a">5.2. System Function</a></li>
<li><a href="#org746b815">5.3. Hazard Instance</a></li>
<li><a href="#orge3b2d27">5.4. Care Process System</a></li>
<li><a href="#org7b9e3b0">5.5. Process Node</a></li>
<li><a href="#org3a32020">5.6. Process Edge</a></li>
<li><a href="#org6ea23da">5.7. Process Group</a></li>
<li><a href="#orgb5c82cb">5.8. Cause and Effect</a></li>
<li><a href="#orga24028d">5.9. Issue Log</a></li>
<li><a href="#orgceb2e6e">5.10. Report</a></li>
</ul>
</li>
<li><a href="#org5dd5080">6. * Resources</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgd2f2924" class="outline-2">
<h2 id="orgd2f2924"><span class="section-number-2">1</span> Dependencies</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>The program is tested on Python 3.74, Django 3.09, Django Rest Framework 3.9, Ant Design Pro 4.0 (GGEditor 2.04)</li>
<li>According to Django Rest Framework's official documentations, the following requirements are optional
<ul class="org-ul">
<li>PyYAML, uritemplate (5.1+, 3.0.0+) - Schema generation support.</li>
<li>Markdown (3.0.0+) - Markdown support for the browsable API.</li>
<li>Pygments (2.4.0+) - Add syntax highlighting to Markdown processing.</li>
<li>django-filter (1.0.1+) - Filtering support.</li>
<li>django-guardian (1.1.1+) - Object level permissions support.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgd9be24e" class="outline-2">
<h2 id="orgd9be24e"><span class="section-number-2">2</span> Develop &amp; Build</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Use 'npm start' to run front-end application in developing environment</li>
<li>Use 'umi build' to build front-end pages, all the build files will be stored in the '/dist' folder</li>
<li>Front-end program is set to run on port 8000, you can change the port in '/config/proxy.ts'</li>
<li>run backend service on port 9000</li>
</ul>
<pre class="example">
python3 manage.py runserver 9000
</pre>
</div>
</div>
<div id="outline-container-org3729bd7" class="outline-2">
<h2 id="org3729bd7"><span class="section-number-2">3</span> Deployment</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgd3c1aea" class="outline-3">
<h3 id="orgd3c1aea"><span class="section-number-3">3.1</span> Environment Preparation</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>Install required Python3 packages manually (tested on Debian 10)</li>
</ul>
<div class="org-src-container">
<pre class="src src-bash">apt-get install python3-pip
pip3 install django
pip3 install djangorestframework
pip3 install markdown
pip3 install django-filter
pip3 install pymysql
pip3 install djangorestframework-jwt
</pre>
</div>
<ul class="org-ul">
<li>Install required Python3 packages automatically
<ul class="org-ul">
<li>you can also install the required packages using 'requirements.txt' (not tested)</li>
</ul></li>
</ul>
<div class="org-src-container">
<pre class="src src-bash">pip install -r requirements.txt
</pre>
</div>
</div>
</div>
<div id="outline-container-orgbf8eec2" class="outline-3">
<h3 id="orgbf8eec2"><span class="section-number-3">3.2</span> Nginx Configuration</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>Put all the front-end build files in Nginx' target folder, then modify the Nginx configuration manually</li>
<li>This is an example of Nginx configuration
<ul class="org-ul">
<li>The program does not force SSL connection, but it is recommended to add SSL support</li>
</ul></li>
<li>The back-end service is running on port 9000, you can change the number to any ports you want, but remember to change the backend service too</li>
</ul>
<pre class="example">
server {
        lisnten 80;
        server_name yourdomainname.com;

        root /path/to/your/folder/;
        index index.html;

        location / {
                try_files $uri $uri/ /index.html;
        }

        location /api {
                proxy_pass http://localhost:9000;
                proxy_redirect default;
        }
}
</pre>
</div>
</div>
<div id="outline-container-org730a189" class="outline-3">
<h3 id="org730a189"><span class="section-number-3">3.3</span> Back-end Application</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li>As Python does not enforce developers to compile its source code before running, the back-end application can be run directly through Django's 'run server' command</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org1b0bf99" class="outline-2">
<h2 id="org1b0bf99"><span class="section-number-2">4</span> APIs &amp; Source Code Structure</h2>
<div class="outline-text-2" id="text-4">
</div>
