docs/maintanence guide.org
** APIs
| Related Data                              | Name       | Description                                                 |
|-------------------------------------------+------------+-------------------------------------------------------------|
| Care Setting                              | listcs     | list all care settings                                      |
|                                           | addcs      | add new care setting                                        |
|                                           | updatecs   | update care setting                                         |
|                                           | removecs   | remove care setting                                         |
|-------------------------------------------+------------+-------------------------------------------------------------|
| System Function                           | listsf     | list all system functions                                   |
|                                           | addsf      | add new system function                                     |
|                                           | updatesf   | update system function                                      |
|                                           | removesf   | remove system function                                      |
|-------------------------------------------+------------+-------------------------------------------------------------|
| Hazard Instance                           | listhi     | list all hazard instances                                   |
|                                           | addhi      | add new hazard instance                                     |
|                                           | updatehi   | update hazard instance                                      |
|                                           | removehi   | remove hazard instance                                      |
|-------------------------------------------+------------+-------------------------------------------------------------|
| Issue Log                                 | listil     | list all issue logs                                         |
|                                           | addil      | add new issue log                                           |
|                                           | updateil   | update issue log                                            |
|                                           | removeil   | remove issue log                                            |
|-------------------------------------------+------------+-------------------------------------------------------------|
| Process System                            | listps     | list all process systems                                    |
|                                           | addps      | add new process system                                      |
|                                           | updateps   | update process system                                       |
|                                           | removeps   | remove process system                                       |
|-------------------------------------------+------------+-------------------------------------------------------------|
| Process Node                              | listpn     | list all process nodes                                      |
|                                           | addpn      | add new process node                                        |
|                                           | updatepn   | update process node                                         |
|                                           | removepn   | remove process node                                         |
|-------------------------------------------+------------+-------------------------------------------------------------|
| Process Edge                              | listpe     | list all process edges                                      |
|                                           | addpe      | add new process edge                                        |
|                                           | updatepe   | update process edge                                         |
|                                           | removepe   | remove process edge                                         |
|-------------------------------------------+------------+-------------------------------------------------------------|
| Risk Matrix                               | listrm     | list all risk matrixs                                       |
|                                           | addrm      | add new risk matrix                                         |
|                                           | updaterm   | update risk matrix                                          |
|                                           | removerm   | remove risk matrix                                          |
|-------------------------------------------+------------+-------------------------------------------------------------|
| Report                                    | listre     | list all reports                                            |
|                                           | addre      | add new report                                              |
|                                           | updatere   | update report                                               |
|                                           | removere   | remove report                                               |
|-------------------------------------------+------------+-------------------------------------------------------------|
| Hazard Type                               | listht     | list all hazard types                                       |
|                                           | addht      | add new hazard type                                         |
|                                           | updateht   | update hazard type                                          |
|                                           | removeht   | remove hazard type                                          |
|-------------------------------------------+------------+-------------------------------------------------------------|
| System (System Function)                  | listsy     | list all systems                                            |
|                                           | addsy      | add new system                                              |
|                                           | updatesy   | update system                                               |
|                                           | removesy   | remove system                                               |
|-------------------------------------------+------------+-------------------------------------------------------------|
| Process Node Group                        | listng     | list all node groups                                        |
|                                           | addng      | add new node group                                          |
|                                           | updateng   | update node group                                           |
|                                           | removeng   | remove node group                                           |
|-------------------------------------------+------------+-------------------------------------------------------------|
| Process Node's associated System Function | listpnsf   | list all process node's system function association records |
|                                           | addpnsf    | add new process node's system function association record   |
|                                           | updatepnsf | update process node's system function association record    |
|                                           | removepnsf | remove process node's system function association record    |
|-------------------------------------------+------------+-------------------------------------------------------------|
| Process Node's associated Hazard Instance | listpnhi   | list all process node's hazard instance association records |
|                                           | addpnhi    | add new process node's hazard instance association record   |
|                                           | updatepnhi | update process node's hazard instance association record    |
|                                           | removepnhi | remove process node's hazard instance association record    |
