docs/maintanence guide.html
<div id="outline-container-orgd09410c" class="outline-3">
<h3 id="orgd09410c"><span class="section-number-3">4.1</span> APIs</h3>
<div class="outline-text-3" id="text-4-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Related Data</th>
<th scope="col" class="org-left">Name</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Care Setting</td>
<td class="org-left">listcs</td>
<td class="org-left">list all care settings</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">addcs</td>
<td class="org-left">add new care setting</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">updatecs</td>
<td class="org-left">update care setting</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">removecs</td>
<td class="org-left">remove care setting</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">System Function</td>
<td class="org-left">listsf</td>
<td class="org-left">list all system functions</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">addsf</td>
<td class="org-left">add new system function</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">updatesf</td>
<td class="org-left">update system function</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">removesf</td>
<td class="org-left">remove system function</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Hazard Instance</td>
<td class="org-left">listhi</td>
<td class="org-left">list all hazard instances</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">addhi</td>
<td class="org-left">add new hazard instance</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">updatehi</td>
<td class="org-left">update hazard instance</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">removehi</td>
<td class="org-left">remove hazard instance</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Issue Log</td>
<td class="org-left">listil</td>
<td class="org-left">list all issue logs</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">addil</td>
<td class="org-left">add new issue log</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">updateil</td>
<td class="org-left">update issue log</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">removeil</td>
<td class="org-left">remove issue log</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Process System</td>
<td class="org-left">listps</td>
<td class="org-left">list all process systems</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">addps</td>
<td class="org-left">add new process system</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">updateps</td>
<td class="org-left">update process system</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">removeps</td>
<td class="org-left">remove process system</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Process Node</td>
<td class="org-left">listpn</td>
<td class="org-left">list all process nodes</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">addpn</td>
<td class="org-left">add new process node</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">updatepn</td>
<td class="org-left">update process node</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">removepn</td>
<td class="org-left">remove process node</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Process Edge</td>
<td class="org-left">listpe</td>
<td class="org-left">list all process edges</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">addpe</td>
<td class="org-left">add new process edge</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">updatepe</td>
<td class="org-left">update process edge</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">removepe</td>
<td class="org-left">remove process edge</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Risk Matrix</td>
<td class="org-left">listrm</td>
<td class="org-left">list all risk matrixs</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">addrm</td>
<td class="org-left">add new risk matrix</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">updaterm</td>
<td class="org-left">update risk matrix</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">removerm</td>
<td class="org-left">remove risk matrix</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Report</td>
<td class="org-left">listre</td>
<td class="org-left">list all reports</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">addre</td>
<td class="org-left">add new report</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">updatere</td>
<td class="org-left">update report</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">removere</td>
<td class="org-left">remove report</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Hazard Type</td>
<td class="org-left">listht</td>
<td class="org-left">list all hazard types</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">addht</td>
<td class="org-left">add new hazard type</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">updateht</td>
<td class="org-left">update hazard type</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">removeht</td>
<td class="org-left">remove hazard type</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">System (System Function)</td>
<td class="org-left">listsy</td>
<td class="org-left">list all systems</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">addsy</td>
<td class="org-left">add new system</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">updatesy</td>
<td class="org-left">update system</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">removesy</td>
<td class="org-left">remove system</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Process Node Group</td>
<td class="org-left">listng</td>
<td class="org-left">list all node groups</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">addng</td>
<td class="org-left">add new node group</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">updateng</td>
<td class="org-left">update node group</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">removeng</td>
<td class="org-left">remove node group</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Process Node's associated System Function</td>
<td class="org-left">listpnsf</td>
<td class="org-left">list all process node's system function association records</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">addpnsf</td>
<td class="org-left">add new process node's system function association record</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">updatepnsf</td>
<td class="org-left">update process node's system function association record</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">removepnsf</td>
<td class="org-left">remove process node's system function association record</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Process Node's associated Hazard Instance</td>
<td class="org-left">listpnhi</td>
<td class="org-left">list all process node's hazard instance association records</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">addpnhi</td>
<td class="org-left">add new process node's hazard instance association record</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">updatepnhi</td>
<td class="org-left">update process node's hazard instance association record</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">removepnhi</td>
<td class="org-left">remove process node's hazard instance association record</td>
</tr>
</tbody>
</table>
</div>
</div>
