docs/maintanence guide.org
** Source Code Structure
| Folder                  | Description                          |
|-------------------------+--------------------------------------|
| /frontend               | all the front-end related files      |
| /frontend/src/pages     | front-end main source code files     |
| /frontend/src/assets    | some front-end resource files        |
| /frontend/dist          | front-end build files                |
| /frontend/configuration | front-end configuration files        |
| /backend                | all the back-end related files       |
| /backend/venv           | back-end Python3 virtual environment |
| /backend/src            | back-end source code files           |
| /backend/src/smart_main | back-end main source code files      |

* Database
** Care Setting
| Database Item | Related Concept          |
|---------------+--------------------------|
| cs_name       | Care Setting Name        |
| cs_desc       | Care Setting Description |

** System Function
| Database Item | Related Concept             |
|---------------+-----------------------------|
| sf_name       | System Function Name        |
| sf_desc       | System Function Description |
| sf_parent     | Associated System           |

** Hazard Instance
| Database Item | Related Concept                     |
|---------------+-------------------------------------|
| hi_name       | Hazard Instance Name                |
| hi_desc       | Hazard Instance Description         |
| hi_inse       | Initial Severity                    |
| hi_inli       | Initial Likelihood                  |
| hi_rese       | Residual Severity                   |
| hi_reli       | Residual Likelihood                 |
| hi_inrr       | Initial Risk Rating                 |
| hi_rerr       | Residual Risk Rating                |
| hi_clju       | Clinical Justification              |
| hi_parent     | Associated Hazard Type              |
| hi_ps         | Associated Process Step (Abandoned) |
| hi_sf         | Associated System Function          |

** Care Process System
| Database Item | Related Concept            |
|---------------+----------------------------|
| ps_name       | Process System Name        |
| ps_desc       | Process System Description |

** Process Node
| Database Item | Related Concept                                    |
|---------------+----------------------------------------------------|
| label         | Node Label                                         |
| pn_desc       | Node Description                                   |
| x             | Coordinate x                                       |
| y             | Coordinate y                                       |
| color         | Node color (Used to draw different types of nodes) |
| size          | Node size (Used to draw different tyeps of nodes)  |
| shape         | Node shape (Used to draw different types fo nodes) |
| pn_cs         | Associaed Care Setting                             |
| pn_ps         | Associated Process System                          |
| parent        | Associated Group                                   |

** Process Edge
| Database Item | Related Concept                        |
|---------------+----------------------------------------|
| label         | Edge Label                             |
| source        | Start Point (Stores a process node id) |
| target        | End Point (Stores a process node id)   |
| pe_desc       | Edge Description                       |
| pe_ps         | Associated Process System              |

** Process Group
| Database Item | Related Concept           |
|---------------+---------------------------|
| label         | Group Label               |
| x             | Coordinate y              |
| y             | Coordinate x              |
| ng_ps         | Associated Process System |

** Cause and Effect
| Database Item | Related Concept                     |
|---------------+-------------------------------------|
| ca_name       | Cause Name                          |
| ca_desc       | Cause Description                   |
| ca_hi         | Associated Hazard Instance (Cause)  |
| ef_name       | Effect Name                         |
| ef_desc       | Effect Description                  |
| ef_hi         | Associated Hazard Instance (Effect) |
| caco_name     | Cause Control Name                  |
| caco_desc     | Cause Control Description           |
| caco_state    | Cause Control State                 |
| caco_type     | Cause Control Type                  |
| caco_ca       | Associated Cause (Cause Control)    |
| efco_name     | Effect Control Name                 |
| efco_desc     | Effect Control Description          |
| efco_state    | Effect Control State                |
| efco_type     | Effect Control Type                 |
| efco_ef       | Associated Effect (Effect Control)  |

