docs/maintanence guide.html
<div id="outline-container-org8de0890" class="outline-3">
<h3 id="org8de0890"><span class="section-number-3">4.2</span> Source Code Structure</h3>
<div class="outline-text-3" id="text-4-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Folder</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">/frontend</td>
<td class="org-left">all the front-end related files</td>
</tr>

<tr>
<td class="org-left">/frontend/src/pages</td>
<td class="org-left">front-end main source code files</td>
</tr>

<tr>
<td class="org-left">/frontend/src/assets</td>
<td class="org-left">some front-end resource files</td>
</tr>

<tr>
<td class="org-left">/frontend/dist</td>
<td class="org-left">front-end build files</td>
</tr>

<tr>
<td class="org-left">/frontend/configuration</td>
<td class="org-left">front-end configuration files</td>
</tr>

<tr>
<td class="org-left">/backend</td>
<td class="org-left">all the back-end related files</td>
</tr>

<tr>
<td class="org-left">/backend/venv</td>
<td class="org-left">back-end Python3 virtual environment</td>
</tr>

<tr>
<td class="org-left">/backend/src</td>
<td class="org-left">back-end source code files</td>
</tr>

<tr>
<td class="org-left">/backend/src/smart_main</td>
<td class="org-left">back-end main source code files</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-org06af382" class="outline-2">
<h2 id="org06af382"><span class="section-number-2">5</span> Database</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org8aacc3b" class="outline-3">
<h3 id="org8aacc3b"><span class="section-number-3">5.1</span> Care Setting</h3>
<div class="outline-text-3" id="text-5-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Database Item</th>
<th scope="col" class="org-left">Related Concept</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">cs_name</td>
<td class="org-left">Care Setting Name</td>
</tr>

<tr>
<td class="org-left">cs_desc</td>
<td class="org-left">Care Setting Description</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org911d40a" class="outline-3">
<h3 id="org911d40a"><span class="section-number-3">5.2</span> System Function</h3>
<div class="outline-text-3" id="text-5-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Database Item</th>
<th scope="col" class="org-left">Related Concept</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">sf_name</td>
<td class="org-left">System Function Name</td>
</tr>

<tr>
<td class="org-left">sf_desc</td>
<td class="org-left">System Function Description</td>
</tr>

<tr>
<td class="org-left">sf_parent</td>
<td class="org-left">Associated System</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org746b815" class="outline-3">
<h3 id="org746b815"><span class="section-number-3">5.3</span> Hazard Instance</h3>
<div class="outline-text-3" id="text-5-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Database Item</th>
<th scope="col" class="org-left">Related Concept</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">hi_name</td>
<td class="org-left">Hazard Instance Name</td>
</tr>

<tr>
<td class="org-left">hi_desc</td>
<td class="org-left">Hazard Instance Description</td>
</tr>

<tr>
<td class="org-left">hi_inse</td>
<td class="org-left">Initial Severity</td>
</tr>

<tr>
<td class="org-left">hi_inli</td>
<td class="org-left">Initial Likelihood</td>
</tr>

<tr>
<td class="org-left">hi_rese</td>
<td class="org-left">Residual Severity</td>
</tr>

<tr>
<td class="org-left">hi_reli</td>
<td class="org-left">Residual Likelihood</td>
</tr>

<tr>
<td class="org-left">hi_inrr</td>
<td class="org-left">Initial Risk Rating</td>
</tr>

<tr>
<td class="org-left">hi_rerr</td>
<td class="org-left">Residual Risk Rating</td>
</tr>

<tr>
<td class="org-left">hi_clju</td>
<td class="org-left">Clinical Justification</td>
</tr>

<tr>
<td class="org-left">hi_parent</td>
<td class="org-left">Associated Hazard Type</td>
</tr>

<tr>
<td class="org-left">hi_ps</td>
<td class="org-left">Associated Process Step (Abandoned)</td>
</tr>

<tr>
<td class="org-left">hi_sf</td>
<td class="org-left">Associated System Function</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orge3b2d27" class="outline-3">
<h3 id="orge3b2d27"><span class="section-number-3">5.4</span> Care Process System</h3>
<div class="outline-text-3" id="text-5-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Database Item</th>
<th scope="col" class="org-left">Related Concept</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">ps_name</td>
<td class="org-left">Process System Name</td>
</tr>

<tr>
<td class="org-left">ps_desc</td>
<td class="org-left">Process System Description</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org7b9e3b0" class="outline-3">
<h3 id="org7b9e3b0"><span class="section-number-3">5.5</span> Process Node</h3>
<div class="outline-text-3" id="text-5-5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Database Item</th>
<th scope="col" class="org-left">Related Concept</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">label</td>
<td class="org-left">Node Label</td>
</tr>

<tr>
<td class="org-left">pn_desc</td>
<td class="org-left">Node Description</td>
</tr>

<tr>
<td class="org-left">x</td>
<td class="org-left">Coordinate x</td>
</tr>

<tr>
<td class="org-left">y</td>
<td class="org-left">Coordinate y</td>
</tr>

<tr>
<td class="org-left">color</td>
<td class="org-left">Node color (Used to draw different types of nodes)</td>
</tr>

<tr>
<td class="org-left">size</td>
<td class="org-left">Node size (Used to draw different tyeps of nodes)</td>
</tr>

<tr>
<td class="org-left">shape</td>
<td class="org-left">Node shape (Used to draw different types fo nodes)</td>
</tr>

<tr>
<td class="org-left">pn_cs</td>
<td class="org-left">Associaed Care Setting</td>
</tr>

<tr>
<td class="org-left">pn_ps</td>
<td class="org-left">Associated Process System</td>
</tr>

<tr>
<td class="org-left">parent</td>
<td class="org-left">Associated Group</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org3a32020" class="outline-3">
<h3 id="org3a32020"><span class="section-number-3">5.6</span> Process Edge</h3>
<div class="outline-text-3" id="text-5-6">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Database Item</th>
<th scope="col" class="org-left">Related Concept</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">label</td>
<td class="org-left">Edge Label</td>
</tr>

<tr>
<td class="org-left">source</td>
<td class="org-left">Start Point (Stores a process node id)</td>
</tr>

<tr>
<td class="org-left">target</td>
<td class="org-left">End Point (Stores a process node id)</td>
</tr>

<tr>
<td class="org-left">pe_desc</td>
<td class="org-left">Edge Description</td>
</tr>

<tr>
<td class="org-left">pe_ps</td>
<td class="org-left">Associated Process System</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org6ea23da" class="outline-3">
<h3 id="org6ea23da"><span class="section-number-3">5.7</span> Process Group</h3>
<div class="outline-text-3" id="text-5-7">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Database Item</th>
<th scope="col" class="org-left">Related Concept</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">label</td>
<td class="org-left">Group Label</td>
</tr>

<tr>
<td class="org-left">x</td>
<td class="org-left">Coordinate y</td>
</tr>

<tr>
<td class="org-left">y</td>
<td class="org-left">Coordinate x</td>
</tr>

<tr>
<td class="org-left">ng_ps</td>
<td class="org-left">Associated Process System</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgb5c82cb" class="outline-3">
<h3 id="orgb5c82cb"><span class="section-number-3">5.8</span> Cause and Effect</h3>
<div class="outline-text-3" id="text-5-8">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Database Item</th>
<th scope="col" class="org-left">Related Concept</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">ca_name</td>
<td class="org-left">Cause Name</td>
</tr>

<tr>
<td class="org-left">ca_desc</td>
<td class="org-left">Cause Description</td>
</tr>

<tr>
<td class="org-left">ca_hi</td>
<td class="org-left">Associated Hazard Instance (Cause)</td>
</tr>

<tr>
<td class="org-left">ef_name</td>
<td class="org-left">Effect Name</td>
</tr>

<tr>
<td class="org-left">ef_desc</td>
<td class="org-left">Effect Description</td>
</tr>

<tr>
<td class="org-left">ef_hi</td>
<td class="org-left">Associated Hazard Instance (Effect)</td>
</tr>

<tr>
<td class="org-left">caco_name</td>
<td class="org-left">Cause Control Name</td>
</tr>

<tr>
<td class="org-left">caco_desc</td>
<td class="org-left">Cause Control Description</td>
</tr>

<tr>
<td class="org-left">caco_state</td>
<td class="org-left">Cause Control State</td>
</tr>

<tr>
<td class="org-left">caco_type</td>
<td class="org-left">Cause Control Type</td>
</tr>

<tr>
<td class="org-left">caco_ca</td>
<td class="org-left">Associated Cause (Cause Control)</td>
</tr>

<tr>
<td class="org-left">efco_name</td>
<td class="org-left">Effect Control Name</td>
</tr>

<tr>
<td class="org-left">efco_desc</td>
<td class="org-left">Effect Control Description</td>
</tr>

<tr>
<td class="org-left">efco_state</td>
<td class="org-left">Effect Control State</td>
</tr>

<tr>
<td class="org-left">efco_type</td>
<td class="org-left">Effect Control Type</td>
</tr>

<tr>
<td class="org-left">efco_ef</td>
<td class="org-left">Associated Effect (Effect Control)</td>
</tr>
</tbody>
</table>
</div>
</div>
