docs/maintanence guide.org
** Issue Log
| Database Item | Related Concept   |
|---------------+-------------------|
| il_name       | Issue Name        |
| il_desc       | Issue Description |

** Report
| Database Item | Related Concept                         |
|---------------+-----------------------------------------|
| re_name       | Report Name                             |
| re_desc       | Report Description                      |
| re_crm        | Clinical Risk Management System         |
| re_ss         | Summary Safety Statement                |
| re_qa         | Quality Assurance and Document Approval |
| re_cm         | Configuration Management                |

* Resources
- https://umijs.org (UmiJS documentation)
- https://github.com/alibaba/GGEditor/blob/master/README.en-US.md (GGEditor documentation)
- https://pro.ant.design/docs/getting-started (Ant Design Pro)
- https://stackoverflow.com/questions/14484787/wrap-text-in-javascript
  - wrap text into multiple lines
  - used in the 'Care Process Editor'
  - text in each node is wrapped through this method
