docs/maintanence guide.html

<div id="outline-container-orga24028d" class="outline-3">
<h3 id="orga24028d"><span class="section-number-3">5.9</span> Issue Log</h3>
<div class="outline-text-3" id="text-5-9">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Database Item</th>
<th scope="col" class="org-left">Related Concept</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">il_name</td>
<td class="org-left">Issue Name</td>
</tr>

<tr>
<td class="org-left">il_desc</td>
<td class="org-left">Issue Description</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgceb2e6e" class="outline-3">
<h3 id="orgceb2e6e"><span class="section-number-3">5.10</span> Report</h3>
<div class="outline-text-3" id="text-5-10">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Database Item</th>
<th scope="col" class="org-left">Related Concept</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">re_name</td>
<td class="org-left">Report Name</td>
</tr>

<tr>
<td class="org-left">re_desc</td>
<td class="org-left">Report Description</td>
</tr>

<tr>
<td class="org-left">re_crm</td>
<td class="org-left">Clinical Risk Management System</td>
</tr>

<tr>
<td class="org-left">re_ss</td>
<td class="org-left">Summary Safety Statement</td>
</tr>

<tr>
<td class="org-left">re_qa</td>
<td class="org-left">Quality Assurance and Document Approval</td>
</tr>

<tr>
<td class="org-left">re_cm</td>
<td class="org-left">Configuration Management</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-org5dd5080" class="outline-2">
<h2 id="org5dd5080"><span class="section-number-2">6</span> * Resources</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li><a href="https://umijs.org">https://umijs.org</a> (UmiJS documentation)</li>
<li><a href="https://github.com/alibaba/GGEditor/blob/master/README.en-US.md">https://github.com/alibaba/GGEditor/blob/master/README.en-US.md</a> (GGEditor documentation)</li>
<li><a href="https://pro.ant.design/docs/getting-started">https://pro.ant.design/docs/getting-started</a> (Ant Design Pro)</li>
<li><a href="https://stackoverflow.com/questions/14484787/wrap-text-in-javascript">https://stackoverflow.com/questions/14484787/wrap-text-in-javascript</a>
<ul class="org-ul">
<li>wrap text into multiple lines</li>
<li>used in the 'Care Process Editor'</li>
<li>text in each node is wrapped through this method</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: zheyu</p>
<p class="date">Created: 2020-08-22 Sat 20:31</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
